#include <iostream>
#include <cmath>
#include <Windows.h>
using namespace std;
int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	int k, N;
	double P;

	k = 1;
	P = 1;

	cout << "Введіть значення N: "; cin >> N;							             
	while (k <= N)
	{
		P *= ((1. * k * k) / (1. * N * N)) * cos((1. * N * N) / (1. * k * k)); // домножив перші дужки на "1.", щоб не було варнінгів
		k++;
	}
	cout << "P= " << P << endl;
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	k = 1;
	P = 1;
	do
	{
		P *= ((1. * k * k) / (1. * N * N)) * cos((1. * N * N) / (1. * k * k));	
		k++;

	} while (k<=N);
	cout << "P= " << P << endl;
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	P = 1;
	for (int k = 1; k <= N; k++)
	{
		P *= ((1. * k * k) / (1. * N * N)) * cos((1. * N * N) / (1. * k * k));
	}
	cout << "P= " << P << endl;
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	P = 1;
	for (k = N; k >= 1; k--)
	{
		P *= ((1. * k * k) / (1. * N * N)) * cos((1. * N * N) / (1. * k * k));
	}
	cout << "P= " << P << endl;



return 0;
}

